Repository: OriolAbril/sphinx-primer
Catalog: locale/*/LC_MESSAGES/goals.po
Languages: ca

source: Goals of this primer
ca: Objectius d'aquesta guia

source: The main focus of this resource is to give only a very general overview of the sphinx related infrastructure used in ArviZ and PyMC, without explaining much directly.
ca: El focus principal d'aquesta guia és donar només una visió general de la infraestructura relacionada amb Sphinx utilitzada a ArviZ i PyMC, sense explicar gaire directament.

source: Here are some things you should or should not expect from this resource:
ca: Alguns exemples del que hauries o no d'esperar d'aquesta guia:

source: {fas}`times-circle;sd-text-danger` MyST or rST syntax guides
ca: {fas}`times-circle;sd-text-danger` guies de sintaxi de MyST o de rST

source: {fas}`check-circle;sd-text-success` explanations on why MyST and rST are important
ca: {fas}`check-circle;sd-text-success` explicacions sobre per què MyST i rST són importants

source: {fas}`times-circle;sd-text-danger` descriptions about which roles and directives exist
ca: {fas}`times-circle;sd-text-danger` descripcions sobre quins _rols_ i quines _directrius_ existeixen

source: {fas}`check-circle;sd-text-success` explanations on what a role and a directive are
ca: {fas}`check-circle;sd-text-success` explicacions sobre què són els _rols_ i les _directrius_

source: {fas}`times-circle;sd-text-danger` explanation on how to configure sphinx builds
ca: {fas}`times-circle;sd-text-danger` explicacions sobre com configurar les construccions de Sphinx

source: {fas}`check-circle;sd-text-success` brief explanations on all the terms in this table and in the intro diagram
ca: {fas}`check-circle;sd-text-success` explicacions breus de tots els termes en aquesta taula i al diagrama introductori

source: {fas}`times-circle;sd-text-danger` tutorials on how to use the extensions that power ArviZ and PyMC docs
ca: {fas}`times-circle;sd-text-danger` tutorials sobre com utilitzar les extensions que sostenen la documentació d'ArviZ i de PyMC

source: {fas}`check-circle;sd-text-success` descriptions about which extensions are used in ArviZ and PyMC docs and why
ca: {fas}`check-circle;sd-text-success` descripcions sobre quines extensions s'utilitzen en les documentacions d'ArviZ i de PyMC i per què

source: Most of the content will be references to other documentation pages for sphinx, sphinx extensions, the MyST syntax guide... The value of this resource is double fold though. It centralizes all these external references and links to useful documentation in a single place and it explains how all these fit together to serve the documentation goals at ArviZ and PyMC.
ca: La major part del contingut serà referència a altres pàgines de documentació per a sphinx i les seves extensions, la guia de sintaxi MyST... El valor d'aquesta guia és doble. Centralitza totes aquestes referències externes i enllaços a la documentació útil en un sol lloc i explica com es combinen tots els elements relacionats amb Sphinx per servir els objectius de documentació a ArviZ i PyMC.
