Repository: OriolAbril/sphinx-primer
Catalog: locale/*/LC_MESSAGES/index.po
Languages: ca

source: Sphinx core
ca: El nucli de Sphinx

source: Sphinx primer for ArviZ and PyMC contributors
ca: Les beceroles de Sphinx per a col·laboradors d'ArviZ i PyMC

source: sphinx logo
ca: Logo de sphinx

source: Sphinx is a documentation generator.
ca: Sphinx és un generador de documentació

source: Sphinx takes raw text content written with a markup language, and it translates and renders it in an rich output format such as html or pdf.
ca: Sphinx pren contingut de text en brut escrit amb un llenguatge de marques, i el tradueix i el renderitza en un format de sortida ric com html o pdf.

source: The native markup language in Sphinx is rST, however, it is also possible to use MyST, a superset of markdown thanks to the executablebooks project.
ca: El llenguatge de marques natiu en Sphinx és rST, però també és possible utilitzar MyST, un superconjunt de Markdown gràcies al projecte executablebooks.

source: {numref}`sphinx-diagram` outlines the process by which sphinx generates documentation. Don't worry if things don't make much sense yet. The key concept will be explained as they are needed and references to further reading will also be provided in the coming pages.
ca: {numref}`sphinx-diagram` esbossa el procés pel qual sphinx genera documentació. No et preocupis si les coses encara no tenen gaire sentit. El concepte clau s'explicarà, ja que són necessaris i també es proporcionaran referències per a lectura addicional en les properes pàgines.

source: Documentation generation process with Sphinx.
ca: Procés de generació de documentació amb Sphinx.

source: ArviZ and PyMC use both rST and MyST, which can be combined without problem within the same documentation, but the bulk of the content is written in MyST, with rST being used nearly exclusively for docstrings.
ca: ArviZ i PyMC utilitzen tant rST com MyST, que es poden combinar sense problemes dins de la mateixa documentació, però la major part del contingut està escrit en MyST, amb rST utilitzat gairebé exclusivament per a _docstrings_.

source: Why MyST? MyST is a markdown superset, therefore pure markdown is also valid MyST. Markdown is the most common markup language nowadays and both developers and users of ArviZ and PyMC are familiar with it from sites like GitHub or Discourse. Moreover, markdown is the markup language used in Jupyter notebooks. Using MyST also allows us to work indistinctively in `.md` or `.ipynb` files.
ca: Per què MyST? MyST és un superconjunt de _Markdown_, per tant _Markdown_ pur també són marques vàlides en MyST. Markdown és el llenguatge de marques més comú avui en dia i tant desenvolupadors com usuaris d'ArviZ i PyMC estan familiaritzats amb ell degut a llocs com GitHub o Discourse. A més, el _Markdown_ és el llenguatge de marques utilitzat en els quaderns Jupyter. Usar MyST també ens permet treballar indistintament en fitxers `.md` o `.ipynb`.
