Repository: OriolAbril/sphinx-primer
Catalog: locale/*/LC_MESSAGES/core/roles.po
Languages: ca

source: Roles
ca: Rols

source: Roles are for inline content, and are mostly used for formatting and for cross-referencing. Roles require a type and an argument. Optionally, when used for cross-referencing only, roles can also contain a custom text for the hyperlink. Also optionally, some formatting roles accept extra formatting options in addition to the main argument, however, there is no general rule on that, some use parenthesis, others semi colons or commas...
ca: Els rols són per a contingut en línia, i s'utilitzen principalment per a format i per a referències encreuada. Els rols requereixen un tipus i un argument. Opcionalment, quan s'utilitza només com a referència encreuada, els rols també poden contenir un text personalitzat per a l'enllaç. També opcionalment, alguns rols de formatació accepten opcions de formatació addicionals a més de l'argument principal, però, no hi ha cap regla general sobre això, alguns utilitzen parèntesis, altres semi-dos o comes...

source: Rendered content
ca: Contingut renderitzat

source: Formatting role for abbreviations and math: {abbr}`PPL (Probabilistic Programming Language)`, {math}`\exp{x}`
ca: Rols de formatació per abreviacions i fórmules matemàtiques: {abbr}`LPP (Llenguatge de Programació Probabilistic)`, {math}`\exp{x}`

source: Cross-referencing roles: {doc}`markup`, {doc}`back to markup <markup>`, {func}`numpy.array`
ca: Referències encreuades amb rols: {doc}`markup`, {doc}`torna a llenguatge de marques <markup>`, {func}`numpy.array`

source: Raw MyST content
ca: Contingut MyST en brut

source: Raw rST content
ca: Contingut rST en brut

source: Sphinx cross-references are much more powerful and friendly with people reading raw docs than html links. You should probably not use html links unless you have a good reason to do so (i.e. a single external link), and you definitely should always use sphinx cross-references for internal links.
ca: Les referències encreuades de Sphinx són molt més potents i agradables per a persones que llegeixen documents sense renderitzar que els enllaços html. Probablement no hauríeu d'utilitzar enllaços html llevat que tingueu una bona raó per fer-ho (és a dir un sol enllaç extern), i sempre haurieu d'utilitzar referències encreuades de Sphinx per a enllaços interns.

source: For more on sphinx cross-references go to {ref}`cross_referencing` page.
ca: Per més informació sobre referències encreuades de Sphinx visiteu la pàgina {ref}`cross_referencing`.

source: **Resources**
ca: **Recursos**

source: {doc}`Sphinx docs on roles <usage/restructuredtext/roles>`
ca: {doc}`documentació de Sphinx sobre rols <usage/restructuredtext/roles>`

source: [readthedocs page on cross-referencing with sphinx](https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html)
ca: [guia de readthedocs sobre referències encreuades de Sphinx](https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html)
